export const newsData =
[
    {
        "date": "2024-02-02",
        "name": "リニューアルを行いました",
        "desc": <>之機堂を新たなデザインにリニューアルしました。これからもよろしくお願いします！</>
    },
    {
        "date": "2024-02-05",
        "name": "Càgitフォントを公開しました",
        "desc": <>新たにシャレイア文字のセリフ体風フォント「<a href="/download/font/cagit">Càgit</a>」を公開しました！</>
    },
    {
        "date": "2024-02-07",
        "name": "リンク修正",
        "desc": <>BlueSkyのハンドルを変更したため、ページ上部のリンク先を修正しました。</>
    },
    {
        "date": "2024-02-17",
        "name": "永球時計をリニューアル！",
        "desc": <>1年前に制作した地球・永球時計を、改めて<a href="/clock">永球時計</a>として作り直しました！</>
    }
]