import Link from "next/link"

export const newsData =
[
    {
        "date": "2024-02-02",
        "name": "リニューアルを行いました",
        "desc": <>之機堂を新たなデザインにリニューアルしました。これからもよろしくお願いします！</>
    },
    {
        "date": "2024-02-05",
        "name": "Càgitフォントを公開しました",
        "desc": <>新たにシャレイア文字のセリフ体風フォント「<Link href="/download/font/cagit">Càgit</Link>」を公開しました！</>
    },
    {
        "date": "2024-02-07",
        "name": "リンク修正",
        "desc": <>BlueSkyのハンドルを変更したため、ページ上部のリンク先を修正しました。</>
    },
    {
        "date": "2024-02-17",
        "name": "永球時計をリニューアル！",
        "desc": <>1年前に制作した地球・永球時計を、改めて<a href="/clock">永球時計</a>として作り直しました！</>
    },
    {
        "date": "2024-03-12",
        "name": "「ギャラリー」ページを公開しました",
        "desc": <>ロゴ・紋章などの画像ファイルを閲覧・ダウンロードできる「<Link href="/download/gallery">ギャラリー</Link>」ページを公開しました！</>
    },
    {
        "date": "2024-03-28",
        "name": "アクセスカウンター設置",
        "desc": <>ページ下部に雰算字で表記されるアクセスカウンターを設置しました。</>
    },
    {
        "date": "2024-04-13",
        "name": "パンくずリスト設置",
        "desc": <>サイト内の案内としてページ上部にパンくずリストを設置しました。</>
    },
    {
        "date": "2024-05-19",
        "name": "技術棟を増築！",
        "desc": <>新たにWebツールを放り込む予定の「<Link href="/download/gallery">之機堂技術棟</Link>」ページを公開しました！</>
    },
    {
        "date": "2024-07-06",
        "name": "Bosvalフォントを公開しました",
        "desc": <>新たにシャレイア文字のドットフォント「<Link href="/download/font/bosval">Bosval</Link>」を公開しました！</>
    },
    {
        "date": "2024-08-02",
        "name": "一部ページを更新しました",
        "desc": <>ページ構造や内容を一部変更しました。</>
    },
    {
        "date": "2024-10-25",
        "name": "ページを公開しました",
        "desc": <>新たに<Link href="/phunlang/name">雰名</Link>ページを公開しました！</>
    },
]