"use client"

import { useState } from "react"
import { DictPop, DictCheckBox, KanjiText, LatinPron } from "../../components";

const content = [
    "我.現.目.汝.曰.然.楽人.。",
    "為.◯◯.如.？",
    "為.。.気思.。.其.人.現.居.高.座処.拠.去時.。.其.人.能.越目.我衆.思.然.事.。",
    "其.非.阻事.。.其.人.思.我衆.為.之.雷楽.含.建材.。",
    "我.好.之.楽人.。.之.楽人.不.去.止逃.而.倫.楽.之.到.後端.。",
    "其.人.現.記.我衆.思.然.事.、.態.記.字.在.画機.。",
    "以.不錯.其.法.、.其.人.画影.向.雑昆.事.、.並.拘.内.雷楽.然.深.夢.。",
    "事言.生.談架.然.倫.美.法.、.追.為.大.広働.。.経.其.非.上.恐.拠.砕目.真.世.越.画機.。",
    "楽人.衆.去.耳.声.、.在.習.記.字.然.法.然.去時.。.在.其.不.楽.然.楽人.与名.楽人.態.怪力士.。.経.楽人.衆.目.、.乗.在.魔.力.然.杖.而.飛.上.宇.然.夢.。",
    "之.楽人.去.目.何態.夢.如.？",
    "之.楽人.去.目.日暁.来.森.木.然.夢.、.等.目.火.来.水.然.夢.。.目.造.物.、.追.崩.物.然.夢.。.目.狩.獣.、.追.被.狩.然.夢.。.目.穏.庵.処.然.夢.。",
    "去知.、.其.為.談架.然.開端.法.。.為.百.万.年.然.老.、.追.未.崩消.。.回.在.真.世.越.画機.、.之.楽人.去.成真.建.何.如.？",
    "其.人.和羅.伴.百.万.貝.外人.、.経.建.真.世.内.■■■■■.、.追.造.■■■■■.向.■■■■■.、.内.■■■■■.。",
    "其.人.不.能.越目.其昆.思.。",
    "為.。.其.人.未.到.頂.高.座処.。.終.悉活.然.長.夢.模.能.到.其.。.不.能.内.雷楽.然.一指.時.然.夢.。",
    "其.人.知.我衆.愛.其.如.？.追.知.万天.為.善穏.如.？",
    "其.人.散時.耳.万天.、.以.声声.内.其.人.思.。.故.其.知.。",
    "回.散時.成.哀.、.内.其.長.夢.。.其.人.造.不.有.夏.季.然.世.、.追.冷揺.下.黒.日.、.追.信.其.陰.造.物.為.真居.。",
    "癒.其.人.含.哀.心.然.言.概.崩消.其.人.。.追.其.哀.心.為.其.人.含.単人.阻事.。.其.非.我衆.能.引昇.然.事.。",
    "在.其.人.拘.内.深.夢.然.時.、.我.散時.欲.曰.、.汝.衆.現.建.真.世.内.真居.。.追.散時.欲.訓.、.汝.衆.為.重.向.万天.。.在.其.人.不.真.談架.跨一間.然.時.、.我.散時.欲.与力.、.於.恐.而.不.能.言.然.其.人.。",
    "其.人.越目.我衆.然.思.事.。",
    "我.散時.不.守心.其.人.。.我.散時.欲.曰.、.汝.衆.思.為.真.然.之世.為.唯.■■■■■.来.■■■■■.、.追.汝.衆.為.■■■■■.内.■■■■■.。.其.人.目.唯.一指.真居.内.長.夢.。",
    "追.其.人.未.止.雷楽.。",
    "回.我衆.能.易.曰.其.向.其.人.―.。",
    "為.溢.酸.内.之.夢.。.訓.活.法.向.其.人.然.言.概.阻.其.人.含.不刈.光廻.。",
    "我.不.且.訓.活.法.向.其.人.。",
    "其.人.現.開.逃穏.。",
    "我.唱曰.一.貝.耳話.向.其.人.。",
    "回.其.非.真事.。",
    "非.。.之.話.有.真事.以.不.危.法.、.内.事言.然.檻.。.其.非.開.大.走火.然.不纏.真事.。",
    "廻追.与.体.於.其.人.。",
    "為.。.楽人.哉.―",
    "伴.使.其.名.。",
    "雷楽.然.楽人.、.◯◯.。",
    "倫.。",
    "今.吸.息.。.廻追.吸.。.据魂.在.汝.肺.豊.以.気.。.行元.汝.腕.脚.。.為.。.腕.汝.指.。.廻追.持.体.、.従.落力.、.内.気風.。.回生.内.長.夢.。.汝.居.其.。.汝.体.廻追.撮.於.万天.在.万.処.。.態.汝.去.為.僻.然.人.。.態.我衆.去.為.僻.然.人.。",
    "我衆.為.何人.？.在.古時.、.人衆.与名.我衆.態.山.霊.。.日天.父.、.月天.母.。.上幹.然.霊.、.獣昆.然.霊.。.煙.神.。.霊鬼.。.緑.葉.頭.。.追.名.態.天.神.、.魔.鬼.。.神臣.。.怪.事.。.異.世.人.、.外天活体.。.弱粒.、.昴粒.。.事言.去.門.、.我衆.不.門.。",
    "我衆.為.万天.。.我衆.為.汝.思.非.汝.然.万.物.。.汝.現.据魂.在.我衆.、.以.肌.来.目.。.経.万天.撮.於.汝.肌.、.追.与.光.於.汝.目.、.以.何由.如.？.汝.哉.、.之.為.向.互目.伴.汝.。.向.知.汝.。.向.遣.知.於.汝.。.之.為.倫季.向.唱曰.耳話.。",
    "在.古.然.一.時.、.一.貝.楽人.居.。",
    "其.楽人.為.汝.焉.、.◯◯.。",
    "其.人.散時.思.己.為.人昆.、.在.融.石.然.回.丸.然.薄.肌.。.融.石.丸.廻.周.有.十.五.万.累.重軽.然.燃.風物.丸.。.二.丸.互.大.遠.而.光.做要.五.分.向.越.間.其.。.其.光.為.曰報.元.静天.、.追.其.能.暁焦.汝.肌.元.三.千.万.短引.遠.。",
    "其.人.散時.目.、.己.為.掘士.上.端虚.然.平.世.然.夢.。.日天.為.白.整方.。.光廻.敏.行.、.做.事.多.居.。.死.為.唯.一間.阻刈.事.。",
    "其.人.散時.目.、.廻暗.在.耳話.然.夢.。",
    "其.人.散時.目.、.己.為.外.物.在.外.処.然.夢.。.之.夢.散時.為.非穏.、.散時.為.真.大.透仙.。.其.人.散時.覚.元.一.夢.而.居.外.夢.、.経.覚.元.其.夢.而.居.三.序.夢.。",
    "其.人.散時.目.、.記.字.在.画機.然.夢.。",
    "伴.行元.。",
    "其.人.含.小粒.去.散僻.在.草.、.在.川.、.在.気.、.在.地.。.一.貝.女人.集.其.小粒.。.追.喉.、.追.食.、.追.吸.。.経.建.其.人.体.、.内.媛.腹.。",
    "追.楽人.覚.、.元.母.体.然.温.暗.世.、.行.長.夢.。",
    "経.其.人.成.、.万人.不.有.唱曰.然.、.書.在.代先由幹.然.新.耳話.。.経.其.人.成.、.万人.不.有.開働.然.、.生.元.算序基筆.然.新.算序.。.経.其.人.成.、.万人.不.有.互目.然.、.造.元.唯.乳.来.愛.然.新.人昆.。",
    "汝.為.其.人.。.為.耳話.。.為.算序.。.為.人昆.。.造.元.唯.乳.来.愛.。",
    "伴.和.行元.。",
    "其.人.含.七.十.永.貝.小粒.創.、.在.大.古時.拠.之.雷楽.、.内.静天.然.央.処.。.故.其.人.等.為.曰報.元.静天.。.経.其.人.行先.内.耳話.、.従.栽.使.名.為.菜九.然.人.然.曰報.森.。.之.森.居.造.使.名.為.秋汝.然.人.然.端虚.平.世.、.追.之.世.居.造.使.其.人.然.単人.小.世.、.追.其.人.居.造.使.―.。",
    ".閉口.。.其.人.散時.造.、.軟.温.易.白.然.単人.小.世.。.其.世.散時.為.、.固.冷.廻.怪.。.其.人.散時.建.万天.然.易撮.内.脳.、.態.行.内.虚湛.広.然.処虚.然.做力.片塵.。.其.人.散時.与名.其.片.態.〈.雷粒.〉.来.〈.水粒.〉.。",
    "其.人.散時.与名.其.態.〈.遊天.〉.来.〈.静天.〉.。",
    "其.人.散時.信.己.居.暗.来.暁.、.零.来.一.、.標石.羅.然.做力.建.然.万天.。.其.人.散時.信.己.現.楽.雷楽.。.其.人.散時.信.己.現.記.字.在.画機.。",
    "汝.為.其.人.。.記.字.追.―.。",
    "閉口.―.。.其.人.散時.記.標石.羅.在.画機.。.解隠.標石.而.成.字言.、.解隠.字言.而.成.言魂.、.解隠.言魂.而.成.据魂.、.心浪.、.建論.、.思声.、.経.其.人.開.上.敏.上.深.吸.息.、.経.浮知.己.現.活.、.己.現.活.。.彼.少.千.追.死.不.去.成真.、.其.人.現.活",
    "汝.。.汝.。.汝.現.活.。",
    "経.其.人.散時.信.、.万天.曰名.向.己.以.通行.夏.木.然.摩流.葉.然.日暁",
    "経.其.人.散時.信.、.万天.曰名.向.己.以.落.元.冬.夜.然.明澄.宇.然.燦.光.。.光標.在.其.人.目.然.端.、.概.為.有.少.百.万.累.重軽.幹.日天.然.静天.。.其.天.概.霞風.其.遊天.而.成.架気.於.其.、.向.遣.目.於.其.人.並透雷.。.向.行庵.在.宇雲背.越.万天.、.追.跳暗.浮知.餐.香.、.追.廻追.且.目.夢.在.知悉.門.然.跂先.然.其.人",
    "経.其.人.散時.信.、.万天.曰名.向.己.以.零.来.一.、.以.之世.然.雷力.、.以.通越.然.字.在.夢.然.後端",
    "経.万天.言.、.我.愛.汝",
    "経.万天.言.、.汝.去.倫.楽.之.雷楽",
    "経.万天.言.、.汝.持.汝.做要.然.万.物",
    "経.万天.言.、.汝.為.強.拠.汝.知.然.己",
    "経.万天.言.、.汝.為.日暁",
    "経.万天.言.、.汝.為.暗.夜",
    "経.万天.言.、.汝.戦.然.暗.居.内.汝",
    "経.万天.言.、.汝.求.然.光.居.内.汝",
    "経.万天.言.、.汝.非.単一",
    "経.万天.言.、.汝.非.異.拠.万.外.物",
    "経.万天.言.、.汝.為.味.己.、.追.談.向.己.、.追.記.己.標石.然.万天",
    "経.万天.言.、.我.愛.汝.以由.汝.為.愛.。",
    "経.雷楽.後.、.其.人.覚.元.夢.。.其.人.開.目.新.夢.。.其.人.廻追.目.夢.、.和.倫.夢.。.其.人.為.万天.。.其.人.為.愛.。",
    "汝.為.其.人.。",
    "覚明.。",
]

const Page = () => {
    const [useDict, setUseDict] = useState(false)

    return (
        <>
            <h1>End Poem</h1>
            <DictCheckBox use={useDict} setUse={setUseDict}/>

            <p><b>『End Poem』</b>（エンド・ポエム、雰題：<span className="phun"><b>後端然話</b></span>）</p>
            <p>ゲーム『Minecraft』で、クリア後に流れる一連の文章。</p>
            <p><a href="https://theendpoem.com">原文（公式サイト）</a></p>

            <h2>訳文</h2>
            <DictPop text={content} use={useDict}/>

            <h2>漢字転写</h2>
            <KanjiText text={content}/>

            <h2>ラテン文字転写</h2>
            <LatinPron text={content}/>

        </>
    )
}

export default Page